app/controllers/attendances_controller.rb

    def create
        new_attendances = Attendance.create!(attendance_params)
---
INSERT INTO "attendances" ("date", "timeIn", "timeOut", "activities", "sign", "checkedBy", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def show
        attendances = Attendance.where(user_id:  @current_user)
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."user_id" = $1  [["user_id", 10]]