app/controllers/attendances_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def index
        @user = User.find_by(email: params[:email])