app/controllers/payment_request_forms_controller.rb

    def create
        new_payment_request_form = PaymentRequestForm.create!(payment_request_form)
---
INSERT INTO "payment_request_forms" ("generated_by", "budget_holder", "payee", "paid_by", "telephone", "account", "bank", "description", "cost", "budget_code", "checked_by", "checked_by_date", "approved_by_budget_holder_1", "approved_by_budget_holder_1_date", "approved_by_budget_holder_2", "approved_by_budget_holder_2_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"

            user_name = generated_by

            # The Working Period
            start_date = @current_user.attendance.first.date
            end_date = @current_user.attendance.last.date
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."user_id" = $1 ORDER BY "attendances"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "attendances".* FROM "attendances" WHERE "attendances"."user_id" = $1 ORDER BY "attendances"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]



        # 9. Cost - Amount to be Paid
        cost = @current_user.attendance.count * 500
---
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."user_id" = $1  [["user_id", 1]]