app/controllers/payment_approval_forms_controller.rb

    def create
        new_payment_approval_form = PaymentApprovalForm.create!(payment_approval_form)
---
INSERT INTO "payment_approval_forms" ("org", "program", "function", "name", "employee_id", "start_day_of_the_week", "end_date_of_the_week", "number_of_days_worked", "amount_payable", "name_on_account", "bank", "account", "bank_code", "branch_code", "telephone", "prepared_by_name", "user_signature_sign", "prepared_by_date", "approved_by_name", "approved_by_signature", "approved_by_date", "authorized_by_name", "authorized_by_sign", "authorized_by_date", "created_at", "updated_at", "daily_stipend") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27) RETURNING "id"

        employee_id = @current_user.user_detail.id_number

        # 7. Start Date of the Week
        start_day_of_the_week = "#{@current_user.attendance.first.date}"

        # 8. End Date of the Week
        end_date_of_the_week  = "#{@current_user.attendance.last.date}"

        # 9. Number of days Worked
        number_of_days_worked = @current_user.attendance.count
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."user_id" = $1 ORDER BY "attendances"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "attendances".* FROM "attendances" WHERE "attendances"."user_id" = $1 ORDER BY "attendances"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."user_id" = $1  [["user_id", 1]]

        # 10.Amount Payable
        # This Varies depending on the type of contract/ salary terms with the HR
        # Payment calculation below are for interns only
        amount_payable = @current_user.attendance.count * 500
---
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."user_id" = $1  [["user_id", 1]]