app/controllers/pvs_controller.rb

SELECT COUNT(*) FROM "attendances" WHERE "attendances"."user_id" = $1  [["user_id", 1]]
---
    def payment_request_form
        generated_by = "#{@current_user.firstname} #{@current_user.lastname}"
        if(@current_user.org == "ZanaAfrica Programs")
            budget_holder = "Roopal Thaker"
        else
            budget_holder =  "Megan Mukuria"
        end
        payee = generated_by

        if(@current_user.org == "ZanaAfrica Programs")
            paid_by = "ZAP"
        else
            paid_by = "ZAG"
        end

        telephone = @current_user.user_detail.telephone_number
        account = @current_user.user_detail.account_number
        bank = @current_user.user_detail.bank_name

        # Description
        description = "Intern stipend for #{generated_by} from 14th September - 13th October"
        #
        cost = @current_user.attendance.count * 500

SELECT "attendances".* FROM "attendances" WHERE "attendances"."user_id" = $1 ORDER BY "attendances"."id" DESC LIMIT $2  [["user_id", 10], ["LIMIT", 1]]
SELECT "user_details".* FROM "user_details" WHERE "user_details"."user_id" = $1 LIMIT $2  [["user_id", 10], ["LIMIT", 1]]
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."user_id" = $1  [["user_id", 1]]
---

        employee_id = @current_user.user_detail.id_number
        daily_stipend = 500
        start_day_of_the_week = "#{@current_user.attendances.first.date}"
        end_date_of_the_week  = "#{@current_user.attendances.last.date}"
        number_of_days_worked = @current_user.attendances.count