app/controllers/pvs_controller.rb

    def index
        # date of generating pv
        date = Time.new

        fulldate = `#{date.day}/#{date.mont}/#{date.year}`

        # The organisation the user belongs to
        if(@current_user.email includes? "org")
            org = "ZanaAfrica Programs"
        else
            org = "ZanaAfrica Group"
        end

        # Role of the current user
        function = @current_user.role

        # Employee details
        name = @current_user.name
        employee_id = @current_user.id_number
        daily_stipend = 500
        start_day_of_the_week = `#{@current_user.attendances.first.date}`
        end_date_of_the_week  = `#{@current_user.attendances.last.date}`
        number_of_days_worked = @current_user.attendances.count
        amount_payable = @current_user.attendances.count * daily_stipend
---
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."user_id" = $1  [["user_id", 10]]