app/controllers/pvs_controller.rb

            user_name = generated_by

            # The Working Period
            start_date = @current_user.attendance.first.date
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."user_id" = $1 ORDER BY "attendances"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]



        # 9. Cost - Amount to be Paid
        cost = @current_user.attendance.count * 500
---
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."user_id" = $1  [["user_id", 1]]

        employee_id = @current_user.user_detail.id_number

        # 7. Start Date of the Week
        start_day_of_the_week = "#{@current_user.attendance.first.date}"
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."user_id" = $1 ORDER BY "attendances"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

        end_date_of_the_week  = "#{@current_user.attendance.last.date}"

        # 9. Number of days Worked
        number_of_days_worked = @current_user.attendance.count
---
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."user_id" = $1  [["user_id", 1]]