app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "geofrey@zanaafrica.org"], ["LIMIT", 1]]
---
    def create
        @user = User.find_by(email: params[:email])
        if @user&.authenticate(params[:password])
            token = JsonWebToken.encode(user_id: @user.id)
            time = Time.now + 24.hours.to_i

            render json: { jwt: token, exp: time.strftime('%m-%d-%Y %H:%M'),id: @user.id,firstname: @user.firstname,lastname: @user.lastname,
             email: @user.email, role: @user.role }, status: :ok