app/controllers/targets_controller.rb

    def index
        user = User.find(session[:user_id])
        if(user)
            targets = Target.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "targets".* FROM "targets"

    def create
        target = Target.create!(target_params)
---
INSERT INTO "targets" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", " Sales "], ["description", " New plans"], ["created_at", "2022-10-21 12:50:28.842216"], ["updated_at", "2022-10-21 12:50:28.842216"]]