app/controllers/tutorials_controller.rb

    def index
        user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]