app/controllers/user_details_controller.rb

INSERT INTO "user_details" ("name_on_account", "bank_name", "account_number", "bank_code", "branch_code", "telephone_number", "user_id", "created_at", "updated_at", "id_number") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
        user_details = UserDetail.create!(user_payment_details_params)