app/controllers/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "email", "username", "role", "supervisor", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def show
        current_logged_user = User.find(session[:user_id])